Model: "functional_99"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_50 (InputLayer)           [(None, 128)]        0                                            
__________________________________________________________________________________________________
embedding_49 (Embedding)        (None, 128, 32)      160000      input_50[0][0]                   
__________________________________________________________________________________________________
lstm_49 (LSTM)                  (None, 128, 100)     53200       embedding_49[0][0]               
__________________________________________________________________________________________________
dropout_49 (Dropout)            (None, 128, 100)     0           lstm_49[0][0]                    
__________________________________________________________________________________________________
dense_98 (Dense)                (None, 128, 1)       101         dropout_49[0][0]                 
__________________________________________________________________________________________________
flatten_49 (Flatten)            (None, 128)          0           dense_98[0][0]                   
__________________________________________________________________________________________________
activation_49 (Activation)      (None, 128)          0           flatten_49[0][0]                 
__________________________________________________________________________________________________
repeat_vector_49 (RepeatVector) (None, 100, 128)     0           activation_49[0][0]              
__________________________________________________________________________________________________
permute_49 (Permute)            (None, 128, 100)     0           repeat_vector_49[0][0]           
__________________________________________________________________________________________________
concatenate_49 (Concatenate)    (None, 128, 200)     0           dropout_49[0][0]                 
                                                                 permute_49[0][0]                 
__________________________________________________________________________________________________
lambda_49 (Lambda)              (None, 200)          0           concatenate_49[0][0]             
__________________________________________________________________________________________________
dense_99 (Dense)                (None, 1)            201         lambda_49[0][0]                  
==================================================================================================
Total params: 213,502
Trainable params: 213,502
Non-trainable params: 0
__________________________________________________________________________________________________
