Model: "functional_21"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_11 (InputLayer)           [(None, 128)]        0                                            
__________________________________________________________________________________________________
embedding_10 (Embedding)        (None, 128, 32)      160000      input_11[0][0]                   
__________________________________________________________________________________________________
lstm_10 (LSTM)                  (None, 128, 100)     53200       embedding_10[0][0]               
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 128, 100)     0           lstm_10[0][0]                    
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 128, 1)       101         dropout_10[0][0]                 
__________________________________________________________________________________________________
flatten_10 (Flatten)            (None, 128)          0           dense_20[0][0]                   
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 128)          0           flatten_10[0][0]                 
__________________________________________________________________________________________________
repeat_vector_10 (RepeatVector) (None, 100, 128)     0           activation_10[0][0]              
__________________________________________________________________________________________________
permute_10 (Permute)            (None, 128, 100)     0           repeat_vector_10[0][0]           
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 128, 200)     0           dropout_10[0][0]                 
                                                                 permute_10[0][0]                 
__________________________________________________________________________________________________
lambda_10 (Lambda)              (None, 200)          0           concatenate_10[0][0]             
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 1)            201         lambda_10[0][0]                  
==================================================================================================
Total params: 213,502
Trainable params: 213,502
Non-trainable params: 0
__________________________________________________________________________________________________
