Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
text_vectorization (TextVect (None, 128)               0         
_________________________________________________________________
embedding (Embedding)        (None, 128, 70)           350000    
_________________________________________________________________
rnn (RNN)                    (None, 64)                417024    
_________________________________________________________________
dense (Dense)                (None, 1)                 65        
=================================================================
Total params: 767,089
Trainable params: 767,089
Non-trainable params: 0
_________________________________________________________________
